In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import scipy.stats as stats
from sklearn.preprocessing import StandardScaler
import warnings
warnings.filterwarnings("ignore")

In [2]:
data_test = pd.read_csv('test.csv')
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
data_test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [4]:
# Index(['Pclass', 'SibSp', 'Fare', 'sex', 'Age', 'Embarked'],

In [6]:
test_clean_data = data_test[['Pclass', 'SibSp', 'Fare', 'Sex', 'Age', 'Embarked']].copy()

In [7]:
test_clean_data['Sex'] = np.where(data_test['Sex'] == 'male', 0, 1)

In [8]:
test_clean_data.head()

   Pclass  SibSp     Fare  Sex   Age Embarked
0       3      0   7.8292    0  34.5        Q
1       3      1   7.0000    1  47.0        S
2       2      0   9.6875    0  62.0        Q
3       3      0   8.6625    0  27.0        S
4       3      1  12.2875    1  22.0        S

In [9]:
test_clean_data['Age'] = data_test['Age'].fillna(data_test['Age'].median())

In [10]:
test_clean_data['Fare'] = data_test['Fare'].fillna(data_test['Fare'].median())

In [11]:
conditions = [data_test['Embarked'] == 'S', data_test['Embarked'] == 'C', data_test['Embarked'] == 'Q']
choices = [0, 1, 2]
test_clean_data['Embarked'] = np.select(conditions, choices, default=0)

In [12]:
test_clean_data.head()

   Pclass  SibSp     Fare  Sex   Age  Embarked
0       3      0   7.8292    0  34.5         2
1       3      1   7.0000    1  47.0         0
2       2      0   9.6875    0  62.0         2
3       3      0   8.6625    0  27.0         0
4       3      1  12.2875    1  22.0         0

In [13]:
from pathlib import Path  
filepath = Path('C:/Users/akim5\OneDrive/Робочий стіл/train_datasets/titanic/clean_test.csv')   
test_clean_data.to_csv(filepath)